app/Controllers/Carrito_controller.php

SELECT *
FROM `venta`
JOIN `registro` ON `registro`.`id_registro`=`venta`.`id_cliente`
WHERE `venta_fecha` >= '2025-06-17'
AND `venta_fecha` <= '2025-06-17'
---
public function listar_ventas(){
    $detalle_venta = new Detalle_venta_model;
    $venta = new Venta_model();

    $fecha_inicio = $this->request->getGet('fecha_inicio');
    $fecha_fin = $this->request->getGet('fecha_fin');

    $venta->join('registro', 'registro.id_registro=venta.id_cliente');

    if ($fecha_inicio && $fecha_fin) {
        // Aplicar el filtro por fecha si ambas están definidas
        $venta->where('venta_fecha >=', $fecha_inicio)
              ->where('venta_fecha <=', $fecha_fin);
    }

    $data['titulo'] = "Listado de ventas";
    $data['ventas'] = $venta->findAll();

SELECT *
FROM `venta`
JOIN `registro` ON `registro`.`id_registro` = `venta`.`id_cliente`
WHERE `venta`.`id_cliente` = '10'
---
public function listar_ventas_cliente() {
    $venta = new Venta_model();
    $session = session();

    $id_usuario = $session->get('id'); // ✅ Esta es la clave correcta

    if (!$id_usuario) {
        return redirect()->to('/login');
    }

    $data['titulo'] = "Mis compras";

    $data['ventas'] = $venta->join('registro', 'registro.id_registro = venta.id_cliente')
                            ->where('venta.id_cliente', $id_usuario)
                            ->findAll();