app/Controllers/productos_controller.php

    public function form_agregar_producto(){
        $categoria = new Categoria_model();
        $data['categorias']=$categoria->findAll();
        $genero = new Genero_model();
        $data['generos']=$genero->findAll();
        $marca = new Marca_model();
        $data['marcas']=$marca->findAll();
---
SELECT *
FROM `categoria_model`
SELECT *
FROM `genero_model`
SELECT *
FROM `marca_model`

    public function gestionar_productos() {
    $producto_model = new Producto_model();
    $categoria = new Categoria_model();
    $genero = new Genero_model();
    $marca = new Marca_model();

    // Obtener el término de búsqueda del parámetro GET
    $buscar = $this->request->getGet('buscar');

    // Preparar la consulta con los JOINs
    $producto_model = $producto_model
        ->join('categoria_model', 'categoria_model.id_categoria = producto.categoria_producto')
        ->join('genero_model', 'genero_model.id_genero = producto.genero_producto')
        ->join('marca_model', 'marca_model.id_marca = producto.marca_producto');

    // Aplicar filtro si hay término de búsqueda
    if (!empty($buscar)) {
        $producto_model = $producto_model->like('nombre_producto', $buscar);
    }

    // Ejecutar la consulta y obtener resultados
    $data['producto'] = $producto_model->findAll();
---
SELECT *
FROM `producto`
JOIN `categoria_model` ON `categoria_model`.`id_categoria` = `producto`.`categoria_producto`
JOIN `genero_model` ON `genero_model`.`id_genero` = `producto`.`genero_producto`
JOIN `marca_model` ON `marca_model`.`id_marca` = `producto`.`marca_producto`

    public function listar_productos() {
        $producto_model = new Producto_model();

        $data['producto']=$producto_model->where('estado_producto', 1)->where('stock_producto>', 0)
        ->join('categoria_model', 'categoria_model.id_categoria = producto.categoria_producto')->findAll();
---
SELECT *
FROM `producto`
JOIN `categoria_model` ON `categoria_model`.`id_categoria` = `producto`.`categoria_producto`
WHERE `estado_producto` = 1
AND `stock_producto` > 0