app/Controllers/Usuario_contoller.php

SELECT *
FROM `registro`
WHERE `correo_registro` = 'ejem@gmail.com'
AND `estado_registro` = 1
 LIMIT 1
---
      $contrasena = $request->getPOST('contrasena');

      $user_Model = new Registro_model();
      $user = $user_Model->where('correo_registro', $correo)->where('estado_registro', 1)->first();